In [1]:
import pandas as pd

In [8]:
Gender=['Male','Female','Male','Female']
Age=[12,16,15,19]
Height=[170,172,173,174]

df=pd.DataFrame([Gender,Age,Height])

In [10]:
df=df.T

In [11]:
df

        0   1    2
0    Male  12  170
1  Female  16  172
2    Male  15  173
3  Female  19  174

In [12]:
df.columns=['Gender','Age','Height']

In [13]:
df

   Gender Age Height
0    Male  12    170
1  Female  16    172
2    Male  15    173
3  Female  19    174

In [14]:
df.groupby('Gender').agg('sum')

        Age  Height
Gender
Female   35     346
Male     27     343